Repository: eugeneai/paper-zont-2017
Catalog: omegat/omegat/project_save.tmx
Source language: ru
Languages: en_us

source: 1Институт динамики систем и теории управления СО РАН им.
en_us: 1 V.M. Matrosov's institute of system dynamics and control theory SB RAS

source: 2Иркутский национальный исследовательский технический, ул.
en_us: 2National research Irkutsk state technical university,

source: 3Иркутский научный центр СО РАН, ул.
en_us: 3Иркутский scientific center SB RAS,

source: 4Лимнологический институт СО РАН, ул.
en_us: 4Limnological Institute SB RAS,

source: <!-- Панель управления приложением -->
en_us: <!-- The application control panel -->

source: <div taa:content="imei:neg-UMK"></div> <!--Лист согласования..
en_us: <div taa:content="imei:neg-UMK"></div> <!--The approval page..

source: <div taa:content="imei:title-page"></div> <!--Титульный лист..
en_us: <div taa:content="imei:title-page"></div> <!--The title page..

source: <h2 class="nocount c">Содержание
en_us: <h2 class="nocount c">Table of Contents

source: <h2 property="dc:title" datatype="xsd:string"> Объем дисциплины (модуля) и виды учебной работы (разделяется по формам обучения)
en_us: <h2 property="dc:title" datatype="xsd:string"> Amount of discipline (module) content and training activities (divided by form of training)

source: <h2 property="dc:title" datatype="xsd:string">Цели и задачи дисциплины (модуля)
en_us: <h2 property="dc:title" datatype="xsd:string">The goals and the objectives of the discipline (module)

source: <head> <!-- Подключение стилевых таблиц и модулей -->
en_us: <head> <!-- Connecting stylesheets and modules -->

source: <html lang="ru" xmlns="http://www.w3.org/1999/xhtml"
en_us: <html lang="en" xmlns="http://www.w3.org/1999/xhtml"

source: <main lang="ru" resource="#annotation" typeof="oa:Annotation"
en_us: <main lang="en" resource="#annotation" typeof="oa:Annotation"

source: DBPedia resource (dbr) – пространство имен объектов (ресурсов) Wikipedia.
en_us: DBPedia resource (dbr) is the namespace of the objects (resources) of Wikipedia.

source: Dokieli позволяют размечать текст тегами RDFa, копировать документ в собственное хранилище и производить аннотацию элементов текста комментариями читателей и соавторов.
en_us: Dokieli allow to mark up text with tags RDFa, to copy a document in its own repository and make an annotation of the text with readers' and authors' comments.

source: Dublin Core (dc) используется для обозначения элементов редактируемой аннотации, например, заголовков разделов, заголовка документа, типов документов, различных описаний, если они содержатся в документе.
en_us: Dublin Core (dc) is used to describe the elements of authored annotations, for example, section headings, document title, document types, various descriptions contained in the document.

source: Elasticsearch обладает средствами нечеткого сравнения термов, что позволяет развивать систему в направлении реализации систем поиска релевантной информации.
en_us: Elasticsearch has the means of fuzzy comparison of terms that allows construction of relevant information search.

source: Friend-of-a-friend (foaf) позволяет представлять информацию об агентах: физических и юридических лицах, а также программных агентов.
en_us: Friend-of-a-friend (foaf) describes information about agents: physical and legal entities, together with software agents.

source: JSON – основной формат хранения индексируемой информации в системе ElasticSearch, необходимо только на сервере выделить особым образом тройки, которые отвечают за представление ресурса пользователю в результатах поиска.
en_us: JSON is the main format of storage of indexed information in ElasticSearch. For the representation of the resource to the user on the search result page some tripes must be marked as representative of the result.

source: Provenence (prov) обеспечивает словарь терминов и отношений, характеризующих происхождение информации.
en_us: Provenence (prov) provides a vocabulary of terms and relations describing the origin of the information.

source: Schema.org (schema) представляет объекты, распознаваемые поисковыми агентами Google, Yandex, Yahoo и др.
en_us: Schema.org (schema) represents the objects that are recognized by the site scanning agents of Google, Yandex, Yahoo etc.

source: xml:lang="ru" metal:define-macro="page">
en_us: xml:lang="en" metal:define-macro="page">

source: 1. Общая архитектура системы верстки документов
en_us: 1. The general architecture of the document publishing system

source: Адрес модуля приложения - https://github.com/isu-enterprise/isu.aquarium.
en_us: The address of the application source code development page is https://github.com/isu-enterprise/isu.aquarium.

source: Алгоритмы верстки запускаются при наличии соответствующих условий в узлах дерева документа.
en_us: The layout algorithms are activated in the presence of corresponding conditions in the nodes of the document tree.

source: Алгоритмы грамматических преобразований реализованы на сервере.
en_us: The grammar transformation algorithms are implemented on the server.

source: Анализ опыта разработчиков LOD ресурсов показал, что для формирования отношения достаточно использовать RDFa-теги property, typeof и datatype.
en_us: Analysis of the experience of the developers of LOD resources has shown that for the formation of the relationship is sufficient to use RDFa tags property, typeof and datatype.

source: Аннотация.
en_us: Abstract.

source: Архитектура программной системы представлена на Рис. 1 (все взаимодействия, изображенные на рисунке, двунаправленные).
en_us: The architecture of the system is presented in Fig. 1 (all relations shown in the figure are bi-directional).

source: Атрибут data-case задает склонение (падеж и число), в которое надо поставить слова текста.
en_us: The attribute data-case specifies the declination (the case and number) of the words of the text to be substituted.

source: Атрибуты data-m и data-f задают вариант слов, соответствующий роду основного существительного в тексте.
en_us: The attributes data-m (masculine) and data-f (feminine) specify a variant of the word corresponding to the genus of the main noun in the text.

source: База данных системы представляет собой набор средств хранения и обеспечения доступа к разноформатным данным.
en_us: A database of the system is a set of tools for storing and access providing to multi-format data.

source: Благодарности
en_us: Acknowledgments

source: Благодаря нотации LOD реализуется возможность интеграции данных документов и веб-приложений в один результирующий текстовый документ.
en_us: Thanks to the LOD notation, a data integration of documents and web applications into a single resulting text document is being implemented.

source: Благодаря этому технология очень просто масштабируема даже на сервера хранения данных, функционирующих в режиме разделяемого хостинга и поддерживающих среду программирования PHP.
en_us: This technology is very scalable even for shared hosting environment supporting only of PHP programming.

source: Более того, на предприятиях, где функционируют такие среды автоматизации, практически всегда существует большой класс документов, не интегрированных в основной документооборот (например, докладные записки, заявления), документов с трудноформализуемой информацией (например, должностные инструкции), а также документов, получаемых организацией извне и не содержащих логическую разметку (например, стандарты отрасли).
en_us: Moreover, in companies with a deployed document flow automation, there is almost always a wide class of documents that are not integrated in the main document flow (e.g., memos, statements), documents with difficult-to-formalize information (e.g., job descriptions) and the documents received by the organizations from the outside having no contain logical markup (e.g., industry standards).

source: В LOD все ресурсы являются глобальными.
en_us: In LOD all the resources are global.

source: В данном исследовании мы стремимся развить средства автоматизации разметки документа на основе анализа изменений документа, предложенной в [2], и конкретно в этой работе преследуется цель реализации одной из инфраструктурных задач – разработки средств создания документов на платформе веб-браузера.
en_us: In this study, the development of tools is aimed at automating the markup of a document based on the analysis of document changes proposed in [2], and specifically in this work, at implementing one of the infrastructural problems connected with a creation of the documents on the platform web browser controlled with LOD.

source: В данном случае это достигается подстановкой пространства имен по умолчанию, полного URI-адреса текущей страницы, с левой стороны от названия ресурса.
en_us: In this case, this is achieved by substitution of the default namespace - the full URI of the current page - on the left hand side of the name of the resource.

source: В докладе обсуждается вопрос применения технологий Linked Open Data (LOD, открытых связанных данных) для решения задач создания текстовых документов средствами, предоставляемыми современными веб-браузерами.
en_us: The report discusses the utilization of the Linked Open Data (LOD) technologies for solving problems of creating text documents with the editing and programming means provided by modern web browsers.

source: В дополнение к семантической разметке в текст документа встраиваются командные структуры, позволяющие активировать алгоритмы преобразования содержимого, например, инструкции включения частей одних документов в другие, грамматические преобразования фраз.
en_us: In addition to the semantic markup, command structures are embedded in the text of a document. Such structures are used for algorithm activation of content conversion, for example, some structures activate the inclusion of parts of other document in the current one, other instruction organize grammatical transformations of sentences.

source: В дополнение к этому, руководство вуза с целью повышения качества предоставляемых образовательных услуг вводит собственные дополнения к форме, содержанию и требованиям к оформлению документации, в частности, к качеству конвертации в HTML для публикации на сайте вуза.
en_us: In addition, the university management with the aim of improving the quality of educational services introduced its own additions to the form, content and requirements to the documentation typesetting, in particular, to the quality of the conversion to HTML for publication on the website of the university.

source: В качестве основы семантической разметки документа использованы результаты открытого проекта Dokieli [3].
en_us: As the basis for the semantic markup of the documents, the results of the open project Dokieli [3] is used.

source: В качестве таких компонент выступают системы ClioPatria [4] или Jena.
en_us: ClioPatria [4] and Jena are the component implementations.

source: В момент завершения редактирования текст сохраняется в файловой системе сервера.
en_us: At the finishing time moment, the edited text stored on the server file system.

source: В некоторой степени это позволяет время, затрачиваемое на проектирование структуры базы данных для хранилищ частичноструктурированных документов, перенаправить на процесс решения предметной задачи: пользователь (разработчик) обрамляет текстовые данные семантической разметкой.
en_us: In some extent, this allows redirecting time spent on designing the database structure for a storage of partially formalized documents to the process of solving a substantive problem: the user (developer) markups the text data with semantic meaning.

source: В отличие от oa эта онтология представляет, в основном, ментаинформацию о творческом произведении.
en_us: In contrast to oa this ontology describes the documents mainly at metainformation level.

source: В приведенном примере ключевые структуры выделены жирным шрифтом, прокомментируем эти структуры:
en_us: In the presented example, the key structures are highlighted in bold. Let us comment these structures:

source: В приложении добавлен режим редактирования документа в виде формы.
en_us: The application has a mode for the document-editing in a view of form to be filled in.

source: В процессе формирования окончательного вида документа модули интерпретации запрашивают необходимые данные и ресурсы на исходном сервере или других интернет-серверах.
en_us: In the formation of the final form of the document, interpretation modules request the required data and resources on the source server or other Internet servers.

source: В разметке документов используются следующие онтологии.
en_us: In the markup of a document, the following ontologies are used.

source: В режиме редактирования рабочей программы (документа) все теги, имеющие комбинацию атрибутов property="cnt:chars" и datatype="xsd:string", преобразуются в редактируемый текст.
en_us: In edit mode of the work program (document) all tags having the combination of attributes property="cnt:chars" and datatype="xsd:string" are converted to editable text.

source: В результате реализации данного сервиса ЛИН СО РАН получит возможность интегрировать данные о микробиоме озера Байкал в мировую исследовательскую среду видов растений, животных и микроорганизмов аналогично [8].
en_us: The implementation of this service for LIN SB RAS, the researchers will integrate data on the microbiome of lake Baikal in the global research environment of species of plants, animals and micro-organisms similar to [8].

source: В этой онтологии есть полезные отношения типа “часть-целое” (schema:hasPart), “результат творческой деятельности” (schema:CreativeWork), при помощи них описываются разделы документа и строится их иерархическая структура.
en_us: This ontology contains useful relationships like “part-whole” (schema:hasPart), “result of a creative activity” (schema:CreativeWork). The relations are used to describe the sectioning of the document, i.e., its hierarchical structure.

source: Важным преимуществом использования LOD при создании информационных сред является ослабление требований к хранилищам публикуемой информации: сам документ является хранилищем данных в формализованном виде.
en_us: An important advantage of LOD usage in creation of information environments is a weakening of the requirements to published information warehouses: the document itself is the formalized data warehouse.

source: Введение
en_us: Introduction

source: Верстка документа осуществляется при помощи алгоритмов, интерпретирующих отношения между элементами дерева HTML.
en_us: The editing and typesetting of the documents is carried on using algorithms that interpret the relation between the elements of document's HTML tree.

source: Все ключевые статические шаблоны курсов можно поместить на одну страницу шаблонов.
en_us: All the key static templates of courses can be placed on one template page.

source: Вся информация сохраняется либо на серверах, поддерживающих протокол Solid (https://solid.mit.edu/), либо локально в базе данных браузера.
en_us: All the information is stored either on servers that support the Protocol Solid (https://solid.mit.edu/), or locally in the database of a browser.

source: Далее пользователь может выполнить фиксацию (commit) изменений и синхронизацию текста сохраненного документа с сервером системы контроля версий текста.
en_us: After that, the user can commit the changes and synchronize the text of the saved document with a repository.

source: Дальнейшее развитие данного проекта осуществляется по нескольким направлениям: а) совершенствование средств верстки документов, б) автоматизация разметки на основе анализа изменения документов [2], в) реализация практических приложений, г) сбор дополнительной информации о потребностях пользователей, д) разработки средств обеспечения регламентированного доступа к информации.
en_us: Further development of the project is carried out in several directions: a) improvement of the means of typesetting documents, b) the automation of the document structure recognition based on the analysis of its changes [2], c) the implementation of domain applications, d) the collection and analysis of user activity and requirements, d) development of a regulated access to documents.

source: Дальнейшее развитие программных технологий
en_us: Further development of the technologies

source: Дальнейшее совершенствование данной программной системы ведётся в направлении построения графа документооборота на основе анализа передачи данных между документами.
en_us: Further improvement of the software is a construction of a workflow graph based on analysis of data transfer between documents.

source: Данная онтология широко применяется для представления связей между лицами (агентами) в социальной сети.
en_us: This ontology is widely used to represent relations between entities (agents) in a social network.

source: Данная работа продолжает исследования, обозначенные в [2] в части реализации клиентских сервисов, функционирующих на вычислительной платформе веб-браузера.
en_us: This work continues the research outlined in [2] in implementing client services operating on the platform of the web browser.

source: Данные курса и название специальности вставляются в шаблон из контекста документа.
en_us: The course data and the name of the profession is inserted into the template from the context of the document.

source: Данные, хранимые в этих источниках, являются ценным ресурсом при формировании документов.
en_us: These sources data is a valuable resource in the document editing.

source: Данный пример выражает факт, что доверитель (fibol:designatesSignatory) удостоверяется (adoc:hasPassport) при помощи паспорта (acrt:qualification dbr:Passport).
en_us: This example expresses the fact that the principal (fibol:designatesSignatory) is being certified (adoc:hasPassport) with a passport (acrt:qualification dbr:Passport).

source: Дескриптивные возможности технологий семантического веба, средства публикации документов HTML5, а также технологии LOD создают инфраструктурный базис средств создания (верстки) и публикации документов.
en_us: The descriptive capabilities of semantic web technologies, HTML5 document publishing tools and LOD technologies form a infrastructural basis of authoring and publishing documents.

source: Для внесения изменений в содержимое страницы использованы встроенные средства редактирования веб-страниц браузеров (атрибут contentEditable), управляемые специальными библиотеками (например, Medium Editor, https://yabwe.github.io/medium-editor/), позволяющими расширять базовые функции встроенного редактора функциями преобразования структуры документа и его LOD-разметки.
en_us: To make changes in the content of the page, built-in browser editing tools of web pages (contentEditable attribute) are used. The tools are managed by the special libraries (Medium Editor, https://yabwe.github.io/medium-editor/), which extend the basic functions of the built-in editor with document structure conversion and LOD markup.

source: Для генерации таких таблиц разработан сервер веб-страниц данных курсов.
en_us: To generate such tables, a server of web pages of these courses has been developed.

source: Для достижения цели реализован набор серверных функций и функций клиентского (веб-браузерного) JavaScript, позволяющий создавать документы на стороне веб-браузера.
en_us: To achieve the goal a set of server functions and client (web-browser) JavaScript routines has been developed that allows the user to create documents with the web browser.

source: Для каждой ячейки таблицы в самом общем случае задается координата ячейки в кубе и свойства хранимого значения, например, тип данных и единицы измерения.
en_us: For each table cell, in a general case, a coordinate of the cell in the cube and the properties of the stored values, for example, the data type and units have been specified.

source: Для минимального исполнения требований руководства вузов для каждого курса преподавателю требуется оформить как минимум три документа – рабочую программу курса, аннотацию к ней, а также ФОС.
en_us: For the minimum fulfillment of the requirements of the university management for each course the instructor is required to design at least three documents: the working program of the course, the summary and the FAM.

source: Для решения задач обеспечения стандартного для хранилищ данных сервиса доступа SPARQL и полнотекстового поиска разработаны компоненты хранения логического слоя и сопутствующих данных в виде графов троек.
en_us: In order to organize standard SPARQL data source access and full-text search, storage components for the logical layer and related data as a graph of triples have been developed.

source: Для решения этой важной задачи коллективом авторов ведется разработка технологий преобразования, анализа, интерпретации, очистки и отслеживания происхождения табличных данных из неструктурированных источников, концептуализации их естественно-языкового содержания.
en_us: The authors develop technologies for conversion, analysis, interpretation, cleaning and tracking the provenance of the tabular data from unstructured sources, the conceptualization of their natural-language content to provide a solution for this important task.

source: Для этого необходимо дополнительно размечать текстовые и табличные данные RDFa-конструкциями, поддерживаемыми системами обеспечения доступа к данным LOD в биологии, например, BIO2RDF (http://bio2rdf.org/).
en_us: In order to prepare the data and paper publication, the text and tables are to be additionally RDFa marked up with formats supported by biological LOD data servers, e.g., BIO2RDF (http://bio2rdf.org/).

source: Для ясности пользователю представляется документ без taa:-включений с указанием этих включений при помощи специальных тегов и стилей.
en_us: For clarity the document is displayed to the user without taa:-inclusions, and these inclusions are indicated with special tags and styles.

source: Документ – это веб-страница, которая создается из отдельных частей при помощи алгоритмов, реализованных в системе программирования клиентского JavaScript.
en_us: The document is a web page that is composed out of different parts by means of the JavaScript routines functioning within the web browser.

source: Другой важной задачей анализа неструктурированной информации является автоматизация разметки однотипных документов по образцу.
en_us: Another important task of analysis of unstructured information is to automate the layout and the structure recognition of similar documents according to a template.

source: Если по каким-либо причинам не удается реализовать сервис хранения троек средствами ClioPatria, то можно использовать сервисы на основе Java-библиотеки Jena.
en_us: If for any reason an implementation of a service for storing triples by means ClioPatria is not convenient, the Java-based Jena library can be used for the service realization.

source: Если поиск оказался успешным, запускается тело модуля, которое в общем случае вносит изменения в документ.
en_us: If the scan was successful, the body of the module is executed, changing of the document content (tree structure).

source: Задача актуальна, например, в вузах, где накоплено большое количество материала в виде учебных программ и методического обеспечения, который требует преобразования в различные формы представления: учебные программы по стандарту ФОС-3+, электронные курсы moodle и др.
en_us: The task is relevant for universities, where a large amount of material in the form of training programs and handbooks are accumulated. The material could be converted into various forms of preparation, such as training programs on the modern standard FOS-3+, e-courses of moodle, etc.
